       IDENTIFICATION DIVISION.
       PROGRAM-ID. FusionnerFichiers.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT IN-FILE1 ASSIGN TO 'file1.txt'.
           SELECT IN-FILE2 ASSIGN TO 'file2.txt'.
           SELECT OUT-FILE ASSIGN TO 'mergedfile.txt'.
           ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD  IN-FILE1.
       01  IN-RECORD1 PIC X(80).
       FD  IN-FILE2.
       01  IN-RECORD2 PIC X(80).
       FD  OUT-FILE.
       01  OUT-RECORD PIC X(80).
       WORKING-STORAGE SECTION.
       01  WS-RECORD PIC X(80).
       PROCEDURE DIVISION.
           MERGE IN-FILE1 IN-FILE2
           ON ASCENDING KEY IN-RECORD1, IN-RECORD2
           GIVING OUT-FILE.
